case3/TemplateCase0.025/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.489236
-0.469267
-0.449298
-0.429329
-0.409361
-0.389392
-0.369423
-0.349454
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49922
-0.497663
-0.496114
-0.49458
-0.493068
-0.491581
-0.490127
-0.48871
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.49922
0.497663
0.496114
0.49458
0.493068
0.491581
0.490127
0.48871
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
